In [1]:
import pandas as pd

In [14]:
df=pd.read_csv('temp.csv')

In [15]:
df

                      Timestamp  Admin/AHU-101 INLET TEMP (°C)
0      17-Jun-24 6:45:00 AM IST                           25.1
1      17-Jun-24 7:00:00 AM IST                           25.1
2      17-Jun-24 7:15:00 AM IST                           25.1
3      17-Jun-24 7:30:01 AM IST                           25.2
4      17-Jun-24 7:45:00 AM IST                           25.2
...                         ...                            ...
2995  18-Jul-24 11:30:00 AM IST                            9.1
2996  18-Jul-24 11:45:00 AM IST                            9.1
2997  18-Jul-24 12:00:01 PM IST                            9.1
2998  18-Jul-24 12:15:00 PM IST                            9.0
2999  18-Jul-24 12:30:00 PM IST                            9.0

[3000 rows x 2 columns]

In [18]:
df.rename(columns={'Timestamp': 'ds'}, inplace=True)
df.rename(columns={'Admin/AHU-101 INLET TEMP (°C)': 'y'}, inplace=True)

In [19]:
df

                             ds     y
0      17-Jun-24 6:45:00 AM IST  25.1
1      17-Jun-24 7:00:00 AM IST  25.1
2      17-Jun-24 7:15:00 AM IST  25.1
3      17-Jun-24 7:30:01 AM IST  25.2
4      17-Jun-24 7:45:00 AM IST  25.2
...                         ...   ...
2995  18-Jul-24 11:30:00 AM IST   9.1
2996  18-Jul-24 11:45:00 AM IST   9.1
2997  18-Jul-24 12:00:01 PM IST   9.1
2998  18-Jul-24 12:15:00 PM IST   9.0
2999  18-Jul-24 12:30:00 PM IST   9.0

[3000 rows x 2 columns]

In [22]:
df['ds'] = pd.to_datetime(df['ds'], format='%d-%b-%y %I:%M:%S %p IST')

# Format the datetime column to 'YYYY-MM-DD HH:MM:SS' format
df['formatted_date'] = df['ds'].dt.strftime('%Y-%m-%d %H:%M:%S')

In [25]:
df=df.drop(columns=['formatted_date'])

In [28]:
df

                      ds     y
0    2024-06-17 06:45:00  25.1
1    2024-06-17 07:00:00  25.1
2    2024-06-17 07:15:00  25.1
3    2024-06-17 07:30:01  25.2
4    2024-06-17 07:45:00  25.2
...                  ...   ...
2995 2024-07-18 11:30:00   9.1
2996 2024-07-18 11:45:00   9.1
2997 2024-07-18 12:00:01   9.1
2998 2024-07-18 12:15:00   9.0
2999 2024-07-18 12:30:00   9.0

[3000 rows x 2 columns]

In [8]:
df['ds'] = pd.to_datetime(df['ds'], format='%Y-%m-%d')

In [12]:
df['ds'].dtype

dtype('<M8[ns]')

In [27]:
df.to_csv('final1.csv', index=False)